# Conexão com postgres e tabelas do sistema

## Instalando bibliotecas de acesso ao postgres, manipulação de dados e gráficos

In [1]:
#!pip install --user psycopg2-binary
#!pip install --user seaborn
#!pip install --user pandas

### Importando bibliotecas

In [2]:
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import psycopg2

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm
/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

### Usando psycopg2 para configurar conexão

In [3]:
conn = psycopg2.connect(host = "tuffi.db.elephantsql.com", database = "aplkecxq", user = "aplkecxq", password = "sn9xx6DLxTROOfwZNfnnq7DW2GA1qpZv")

# Tabelas

## Usuário

In [4]:
res = pd.read_sql_query("SELECT * FROM usuario", conn)
res

            nome      cpf   senha
0  Cleiton Rasta  1556785   rasta
1        Emanuel   342353    1557
2     Juscileide    11557     777
3          Maria    12312    lola
4         Marlon    45324    edge
5          Lucas    11223  tchola

## Profissional jurídico

In [6]:
res = pd.read_sql_query("SELECT * FROM profissional_juridico", conn)
res

   cpf_usuario  numero_oab
0      1556785        5667
1        12312        6534

## Auxiliado

In [7]:
res = pd.read_sql_query("SELECT * FROM auxiliado", conn)
res

   cpf_usuario     ctps       rg  numero_telefone data_nascimento
0       342353  1328946  1245879          9997872      1978-09-23
1        11557  2454789  8530267          9959752      1988-11-01
2        45324  3578549  8752566          9752664      1991-08-30
3        11223  4587845  2458789          9365654      1979-02-19

## Solicitação

In [9]:
res = pd.read_sql_query("SELECT * FROM solicitacao", conn)
res

   codigo estado_atual data_abertura  cpf_auxiliado  cpf_profissional
0       1       ABERTO    2021-02-21         342353           1556785
1       2       ABERTO    2021-02-28          11223             12312
2       3      FECHADO    2021-03-03          11557           1556785

## Mensagem

In [10]:
res = pd.read_sql_query("SELECT * FROM mensagem", conn)
res

    codigo  codigo_solicitacao  ...          data_envio cpf_remetente
0        1                   1  ... 2021-02-21 09:31:23        342353
1        2                   1  ... 2021-02-21 09:31:45        342353
2        3                   1  ... 2021-02-21 11:49:49       1556785
3        4                   1  ... 2021-02-21 11:50:06       1556785
4        5                   1  ... 2021-02-21 11:50:34       1556785
5        6                   1  ... 2021-02-21 11:51:09       1556785
6        7                   2  ... 2021-02-28 15:27:20         11223
7        8                   2  ... 2021-02-28 15:27:36         11223
8        9                   2  ... 2021-03-01 10:19:58         12312
9       10                   2  ... 2021-03-01 10:20:18         12312
10      11                   2  ... 2021-03-01 10:20:32         12312
11      12                   3  ... 2021-03-03 21:18:25         11557
12      13                   3  ... 2021-03-03 21:18:36         11557
13      14                   3  ... 2021-03-03 21:18:54         11557
14      15                   3  ... 2021-03-04 09:11:02       1556785

[15 rows x 5 columns]